src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МатериалыСобственные</name>
      <description>Материалы (собственные)</description>
    </items>
    <items>
      <name>МатериалыКлиента</name>
      <description>Материалы клиента</description>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
    </items>
    <items>
      <name>Услуги</name>
      <description>Услуги</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетБухгалтерскогоУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>МатериалКлиента</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Номенклатура/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    // Получаем родителя (группу)
    Родитель = ЭтотОбъект.Родитель;
    
    // Если родитель не определен, проверять не нужно
    Если Родитель = Справочники.Номенклатура.ПустаяСсылка() Тогда
        Возврат;
    КонецЕсли;
    
    // Проверяем, является ли родитель одной из предопределенных групп
    Если Родитель = Справочники.Номенклатура.Товары Или
       Родитель = Справочники.Номенклатура.Услуги Или
       Родитель = Справочники.Номенклатура.МатериалыСобственные Или
       Родитель = Справочники.Номенклатура.МатериалыКлиента Тогда
        
        // Определяем допустимый тип для данной группы
        ДопустимыйТип = Неопределено;
        Если Родитель = Справочники.Номенклатура.Товары Тогда
            ДопустимыйТип = Перечисления.ТипыНоменклатуры.Товар;
        ИначеЕсли Родитель = Справочники.Номенклатура.Услуги Тогда
            ДопустимыйТип = Перечисления.ТипыНоменклатуры.Услуга;
        ИначеЕсли Родитель = Справочники.Номенклатура.МатериалыСобственные Тогда
            ДопустимыйТип = Перечисления.ТипыНоменклатуры.Материал;
        ИначеЕсли Родитель = Справочники.Номенклатура.МатериалыКлиента Тогда
            ДопустимыйТип = Перечисления.ТипыНоменклатуры.МатериалКлиента;
        КонецЕсли;
        
        // Сравниваем
        Если ЭтотОбъект.ТипНоменклатуры <> ДопустимыйТип Тогда
            Сообщить("Ошибка: в группе """ + Родитель.Наименование + 
                     """ можно создавать элементы только с типом """ + 
                     Строка(ДопустимыйТип) + """.");
            Отказ = Истина;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
